// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// int Prompt(string message)
// {
//     System.Console.Write($"{message} ");
//     string value = Console.ReadLine();
//     int result = Convert.ToInt32(value);
//     return result;
// }
// int[] InputArray(int lenght)
// {
//     int[] array = new int [lenght];
//     for (int i = 0; i < array.Length; i++)
//     {
//         array[i] = Prompt ($"Элемент номер {i + 1}");
//     }
//     return array;
// }
// void PrintArray (int[] array)
// {
//     for (int i = 0; i < array.Length; i++)
//     {
//         System.Console.Write($"{array [i]}, ");
//     }
//     System.Console.Write(" ");
// }

// int CountPositiveNumbers(int[] array)
// {
//     int count = 0;
//     for (int i = 0; i < array.Length; i++)
//     {
//         if (array[i] > 0)
//         {
//             count++;
//         }
//     }
//     return count;
// }


// int lenght = Prompt("Введите количество элементов");
// int[] array;
// array = InputArray(lenght);
// PrintArray(array);
// System.Console.WriteLine($"Количество элементов больше 0 - {CountPositiveNumbers (array)}");

// Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.

